/*Array——数组*/
#include <stdio.h>

int main(void)
{
    int a[10];
    float b[10];
    /*注意：
    定义数组时不可以对下标动态定义，即类似于
    int n;scanf("%d",&n);int a[n];
    等不合法，必须静态定义
    */

    a[1] = 2233;                    //直接赋值
    int c[5] = {0, 1, 2, 3, 4};     //可以这样赋值
    int d[10] = {1, 2, 3, 4, 5, 8}; //也可以不进行完全赋值，后面的元素为默认值
    int e[] = {1, 2, 3, 4, 5};      //当明确数组大小时可以不用下标来表明长度

    //系统对于未初始化的数据赋值为"0" ,"\0" ,"NULL"

    int f[2][3]; //定义二维数组，两行三列
    //这里可以看作两个元素f[0],f[1],每个元素包含了f[0][0],f[0][1],f[0][2]
    //排列顺序为(0,0),(0,1),(0,2),(1,0),(1,1),(1,2)……
    //看作一个矩阵
    int f1[2][3][5]; //同理可以定义多维数组

    int g[2][3] = {{1, 2, 3}, {2, 3, 4}}; //按照行来定义：第一个方括号为第一行的元素……
    int h[2][3] = {1, 2, 3, 4, 5, 6};     //按照排列顺序来定义
    int i[3][4] = {{1}, {}, {2}};         //部分赋值，其余为默认值;括号为空时全为0

    int j[2][3] = {1, 2, 3, 4, 5, 6};
    int j1[][3] = {1, 2, 3, 4, 5, 6}; //以上两种等价，在提供全部初始数据时第一个下标可省略

    int k[][3] = {{0, 0, 3}, {}, {}, {1, 2, 3}}; //这样也可以

    int m[3];
    m[0] = 1;
    m[1] = 2;
    m[2] = 3;
    /*注意：
    定义了m[3],代表m数组有3个元素，为m[0],m[1],m[2],取不到m[3]
    */
}